enchiridion.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-07-21 Mon 00:12 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0" />
<title>Enchiridion #51</title>
<meta name="generator" content="Org Mode" />
<link rel="apple-touch-icon" sizes="180x180" href="/apple-touch-icon.png">
<link rel="icon" type="image/png" sizes="32x32" href="/favicon-32x32.png">
<link rel="icon" type="image/png" sizes="16x16" href="/favicon-16x16.png">
<link rel="apple-touch-icon" sizes="180x180" href="./apple-touch-icon.png">
<link rel="icon" type="image/png" sizes="32x32" href="./favicon-32x32.png">
<link rel="icon" type="image/png" sizes="16x16" href="./favicon-16x16.png">
<meta property="og:title" content="Enchiridion #51">
<meta property="og:description" content="">
<meta property="og:image" content="https://notes.neeasade.net/assets/img/backgrounds/newfeather.png">
<meta property="og:url" content="https://notes.neeasade.net/enchiridion.html">
<meta property="description" content="">
<meta name="twitter:card" content="summary">
<link rel='stylesheet' href='/assets/css/colors.css?sum=2fec13999255583f3b6d5acd0d883869'>
<link rel='stylesheet' href='./assets/css/colors.css?sum=2fec13999255583f3b6d5acd0d883869'>
<link rel='stylesheet' href='/assets/css/normalize.css?sum=112272e51c80ffe5bd01becd2ce7d656'>
<link rel='stylesheet' href='./assets/css/normalize.css?sum=112272e51c80ffe5bd01becd2ce7d656'>
<link rel='stylesheet' href='/assets/css/magick.css?sum=521d83a911ff9e2fb88118536652e49c'>
<link rel='stylesheet' href='./assets/css/magick.css?sum=521d83a911ff9e2fb88118536652e49c'>
<link rel='stylesheet' href='/assets/css/magick-extra.css?sum=d6efac35e229065b9c00d6cdc8d181b5'>
<link rel='stylesheet' href='./assets/css/magick-extra.css?sum=d6efac35e229065b9c00d6cdc8d181b5'>
</head>
<body>
<main id="content" class="content">
<header>
<div style="float: left">
    <a href='/index.html'>../ＳＴＸ</a>
</div>

<div style="float: right">
    
    <a href="https://raw.githubusercontent.com/neeasade/neeasade.github.io/source/posts/Enchiridion.org">source</a>
</div>
<h1 class=title>
    Enchiridion #51
</h1>
<div class="org-center">
<p>

</p>
</div>
<span class=pubinfo>
    Published 2025-07-18
</span>
</header>
<hr>
<blockquote>
<p>
How long will you wait before you consider yourself capable of the best,
and of living in accord with reason? You&rsquo;ve been through the reasoning
and accepted the principles. What great master are you waiting for, so
that you can stall your improvement until his arrival? You&rsquo;re no longer
a child, but an adult. If you&rsquo;re negligent and lazy, keep delaying and
making a collection of one good intention after another, naming day
after day on which you&rsquo;ll start to take care of yourself, you&rsquo;ll just go
on without getting better, and you&rsquo;ll live and die miserable.
</p>

<p>
Right now, consider yourself worthy of living like a grownup, and
someone who&rsquo;s getting better. Let what seems right to you be an iron
law. And if anything comes your way that seems like work, or seems
tempting or glorious or disgraceful, remember that the struggle is on
already, that the Olympics have begun and can&rsquo;t be delayed, that what
you do today &#x2013; this minute &#x2013; will determine whether progress is made
or lost. Socrates became perfect this way, making everything an
opportunity for his improvement, following only reason. Though you&rsquo;re
not yet a Socrates, you should live as though you intend to become a
Socrates.
</p>
</blockquote>

<ul class="org-ul">
<li><a href="http://www.ideonautics.net/manual2.htm">http://www.ideonautics.net/manual2.htm</a>, section 51</li>
</ul>

<p>
This entry appears towards the end of the manual.
</p>

<footer>
    <div style="float: left">
        
    </div>
    <div style="text-align: right">
         <a href='https://notes.neeasade.net/planner-reflections.html'>older: planner notes</a> 
    </div>
</footer>
<hr>
</main>
</body>
</html>
